fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДнейВОтпуске</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
		Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Сотрудник", Строка.Сотрудник);
		НайденнеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ПараметрыОтбора);
		ОтпускДней = 0;     
		Для Каждого Стр ИЗ НайденнеСтроки Цикл
			 КоличествоДнейОтпуска = (Стр.ДатаОкончания - Стр.ДатаНачала) / 60 / 60 / 24; 
			 ОтпускДней = ОтпускДней + КоличествоДнейОтпуска; 
		
			 Стр.КоличествоДнейВОтпуске = ОтпускДней; 

		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроанализироватьОтпсука(Команда)
	
	    АдресТоваровВХранилище = ПоместитьТоварыВХранилище();
		
		СтрутураПараметров = Новый Структура("АдресТоваровДокумента", АдресТоваровВХранилище);
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика",СтрутураПараметров,ЭтаФорма,); 
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 &НаСервере
 
Функция ПоместитьТоварыВХранилище() 
	
	Адрес = ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить(),УникальныйИдентификатор); 
	Возврат Адрес; 
	
КонецФункции

#КонецОбласти
